<h1><b>Will You Survive On Titanic AI</b></h1>
<h2>Importing Libraries and Database</h2>

In [1]:
import numpy as np
import random as rn
import pandas as pd
import seaborn as sns

In [2]:
titanic = pd.read_csv(r"titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# sns.pairplot(titanic, hue="Survived")

<h1>Data Cleanup</h1>

In [3]:
titanic = titanic.drop(columns=['Name', 'Cabin','Embarked','Ticket','PassengerId'])
titanic = titanic[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived']]
titanic.head()

   Pclass     Sex   Age  SibSp  Parch     Fare  Survived
0       3    male  22.0      1      0   7.2500         0
1       1  female  38.0      1      0  71.2833         1
2       3  female  26.0      0      0   7.9250         1
3       1  female  35.0      1      0  53.1000         1
4       3    male  35.0      0      0   8.0500         0

In [4]:
class DataProcessing:
    @staticmethod
    def shuffle(x):
        for i in range(len(x)-1,0,-1):
            j=rn.randint(0,i-1)
            x.iloc[j], x.iloc[i] = x.iloc[i], x.iloc[j]
            
    @staticmethod
    def normalization(x):
        values=x.select_dtypes(exclude="object")
        columnNames=values.columns.tolist()
        for column in columnNames[:-1]:
            data = x.loc[:,column]
            max1=max(data)
            min1=min(data)
            for row in range(0,len(x),1):
                xprim=(x.at[row,column]-min1)/(max1-min1)
                x.at[row,column]=xprim 
                
    @staticmethod
    def split(x,k):
        return x[:int(len(x)*k//1)], x[int(len(x)*k//1 +1):]

In [5]:
DataProcessing.shuffle(titanic)

In [6]:


for row in range(len(titanic)-1,-1,-1):
    if titanic.at[row,'Sex']=="male":
        titanic.at[row,'Sex']=1
    elif titanic.at[row,'Sex']=="female":
        titanic.at[row,'Sex']=0
    else:
        titanic = titanic.drop(row,axis=0)

        
# values=titanic.select_dtypes(exclude="object")
# columnNames=values.columns.tolist()
# for column in columnNames:
# column = "PassengerId"
# for row in range(len(titanic)-1,-1,-1):
#     print(titanic.at[row,column])
#     temp = titanic.at[row,column]
#     if isinstance(temp, (int, float, complex)):
#         print(titanic.at[row,column])
        
        
#     else:
#         print(titanic.iloc[row])
#         titanic = titanic.drop(row,axis=0)


titanic.head()

   Pclass Sex   Age  SibSp  Parch      Fare  Survived
0       3   1  30.0      0      0    7.2500         0
1       3   1   NaN      0      0    7.2292         0
2       3   1  16.0      4      1   39.6875         0
3       2   1  16.0      0      0   10.5000         0
4       1   0  23.0      3      2  263.0000         1

In [7]:
DataProcessing.normalization(titanic)
titanic.head()

   Pclass Sex       Age  SibSp     Parch      Fare  Survived
0     1.0   1  0.373669  0.000  0.000000  0.014151         0
1     1.0   1       NaN  0.000  0.000000  0.014110         0
2     1.0   1  0.198296  0.500  0.111111  0.077465         0
3     0.5   1  0.198296  0.000  0.000000  0.020495         0
4     0.0   0  0.285983  0.375  0.222222  0.513342         1

In [8]:
titanic = titanic.dropna()

titanic.head()

   Pclass Sex       Age  SibSp     Parch      Fare  Survived
0     1.0   1  0.373669  0.000  0.000000  0.014151         0
2     1.0   1  0.198296  0.500  0.111111  0.077465         0
3     0.5   1  0.198296  0.000  0.000000  0.020495         0
4     0.0   0  0.285983  0.375  0.222222  0.513342         1
5     0.5   0  0.373669  0.125  0.000000  0.027050         1

In [9]:
trainingSet, validatingSet = DataProcessing.split(titanic,0.7)

In [10]:
titanic

      Pclass Sex       Age  SibSp     Parch      Fare  Survived
0        1.0   1  0.373669  0.000  0.000000  0.014151         0
2        1.0   1  0.198296  0.500  0.111111  0.077465         0
3        0.5   1  0.198296  0.000  0.000000  0.020495         0
4        0.0   0  0.285983  0.375  0.222222  0.513342         1
5        0.5   0  0.373669  0.125  0.000000  0.027050         1
...      ...  ..       ...    ...       ...       ...       ...
1300     0.5   1  0.498935  0.000  0.000000  0.031230         0
1302     0.5   1  0.455092  0.000  0.222222  0.050749         0
1303     0.5   0  0.473882  0.000  0.000000  0.025374         0
1305     0.0   0  0.636728  0.125  0.000000  0.152164         1
1306     1.0   1  0.010397  0.500  0.111111  0.077465         0

[1045 rows x 7 columns]

<h2>k-nearest neighbors algorithm</h2>

In [11]:
class Knn:
    @staticmethod
    def knn(x,element,k=1):
        dist = []
        y = 0
        for i in range(len(x)):
            sum = 0
            for j in range(len(element)-1):
                sum += (x.iloc[i,j] - element.iloc[j])**2
            dist.append(sum**(1/2))
        x.loc[:,"dist"]=dist
        y = x.sort_values("dist")
        kElementów = {}
        for i in range(k):
            kElementów[y["Survived"].iat[i]] = 0
        for i in range(k):
            kElementów[y["Survived"].iat[i]] +=1
        return max(kElementów, key=kElementów.get)
    @staticmethod
    def accuracy(x,z,k):
        good = 0
        for i in range(len(z)):
            if( Knn.knn(x,z.iloc[i],k) == z.iloc[i][6] ):
                good +=1
        return good/z.shape[0]

In [12]:
Knn.accuracy(trainingSet,validatingSet,3)

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.805111821086262

In [13]:
#knn test
for i in range(5):
    DataProcessing.shuffle(titanic)
    trainingSet, validatingSet = DataProcessing.split(titanic,0.7)
    print(Knn.accuracy(trainingSet, validatingSet,4))

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.853035143769968

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8242811501597445

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8402555910543131

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8274760383386581

C:\Users\user\AppData\Local\Temp\ipykernel_11612\4069727225.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.loc[:,"dist"]=dist

0.8466453674121406

In [15]:
validatingSet.head()

     Pclass Sex       Age  SibSp     Parch      Fare  Survived
288     0.5   0  0.393380  0.000  0.000000  0.025374         1
289     0.0   1  0.591191  0.000  0.000000  0.057971         0
290     0.5   1  0.340630  0.000  0.000000  0.025374         0
291     0.5   0  0.314256  0.125  0.222222  0.126872         1
293     0.0   1  0.314256  0.125  0.000000  0.160574         0

<h2>Naive Bayes Algorithm</h2>

In [14]:
class NaiveBayes:
    @staticmethod
    def mean(column):
        return sum(column)/len(column)
    @staticmethod
    def stv(column, mean1):
        tmp=0
        for i in column:
            tmp+=(i-mean1)**2
        return np.sqrt(tmp/len(column))
    @staticmethod
    def gaussProbability(x, mu, sigma):
        if sigma == 0:
            return 0
        exponent=np.exp(-0.5*(x-mu)**2/(sigma**2))
        return 1/(sigma*np.sqrt(2*np.pi))*exponent
    @staticmethod
    def classify(x, sample):
        probability = []
        for className in x['Survived'].unique().tolist():
            p1 = 1
            columns = x.columns.tolist()[:-1]
            data = x[x['Survived'] == className]
            for column in columns:
                dataFromOneColumn = data[column]
                mu = NaiveBayes.mean(dataFromOneColumn)
                sigma = NaiveBayes.stv(dataFromOneColumn, mu)
                prob = NaiveBayes.gaussProbability(sample[column], mu, sigma)
                p1 *= prob
            p2 = x['Survived'].value_counts()[className]
            probability.append(p1*p2/len(x))
        maxIdx = probability.index(max(probability))
        return x['Survived'].unique().tolist()[maxIdx]
    @staticmethod
    def accuracy(trainSet, valSet):
        positiveCases = 0
        for idx, i in valSet.iterrows():
            if i['Survived'] == NaiveBayes.classify(trainSet, i):
                positiveCases += 1
        return positiveCases / len(valSet)

In [ ]:
#naive test
arr = []
for i in range(20):
    DataProcessing.shuffle(titanic)
    arr.append(NaiveBayes.accuracy(trainingSet, validatingSet))
print(arr)
print(sum(arr)/len(arr))